# Selecting Data from a Table

## 1. Basic SELECT Statement

##### To retrieve all data from the student table:

SELECT * FROM student;

##### To retrieve specific columns (e.g., only name and grade):

SELECT name, grade FROM student;

## 2. Using the WHERE Clause

The WHERE clause is used to filter rows based on a condition.

##### Example: Students in 10th grade

SELECT * FROM student WHERE grade = '10th';

##### Example: Students older than 16

SELECT * FROM student WHERE age > 16;

## 3. Comparison Operators in MySQL

In [20]:
import pandas as pd

# Create a small dataset
data = {
    'Operator': ['=', '!=', '<>', '>', '<', '>=', '<=', 'BETWEEN', 'IN', 'NOT IN', 'LIKE', 'NOT LIKE'],
    'Description': ['Equals', 'Not Equal to', 'Not Equal to(alternative)', 'Greater than', 'Less than', 'Greater than or Equal to', 'Less than or equal to', 'Within a range (inclusive)', 'Matches any in a list', 'Excludes list items', 'Pattern matching', 'Pattern not matching']
    }

df = pd.DataFrame(data)
df

    Operator                 Description
0          =                      Equals
1         !=                Not Equal to
2         <>   Not Equal to(alternative)
3          >                Greater than
4          <                   Less than
5         >=    Greater than or Equal to
6         <=       Less than or equal to
7    BETWEEN  Within a range (inclusive)
8         IN       Matches any in a list
9     NOT IN         Excludes list items
10      LIKE            Pattern matching
11  NOT LIKE        Pattern not matching

## 4. Handling NULL Values
- What is NULL?
> NULL represents missing or unknown values. It is not equal to 0, empty string, or any other value.

- Common Mistake (Incorrect):

In [21]:
# This will not work as expected

SELECT * FROM student WHERE grade = NULL;

### Correct Ways to Handle NULL

In [22]:
import pandas as pd

# Create a small dataset
data = {
    'Condition': ['Is NULL', 'Is NOT NULL'],
    'Correct Syntax': ['WHERE grade is NULL', 'WHERE grade is NOT NULL']
}

df = pd.DataFrame(data)
df

     Condition           Correct Syntax
0      Is NULL      WHERE grade is NULL
1  Is NOT NULL  WHERE grade is NOT NULL

### Example: Select students with no grade assigned

SELECT * FROM student WHERE grade IS NULL;

### Example: Select students who have a grade

SELECT * FROM student WHERE grade IS NOT NULL;

## 5. Combining Conditions

In [23]:
# You can use AND, OR, and parentheses to combine conditions.

##### Example: Students in 10th grade and older than 16

SELECT * FROM student WHERE grade = '10th' AND age > 16;

##### Example: Students in 9th or 12th grade

SELECT * FROM student WHERE grade = '9th' OR grade = '12th'

#### Example: Complex conditions

SELECT * FROM student 

WHERE (grade = '10th' OR grade = '11th') AND age >= 16;

## 6. Sorting Results with ORDER BY

In [24]:
# Sort by age in ascending order:

SELECT * FROM student ORDER BY age ASC;

In [25]:
# Sort by name in descending order:

SELECT * FROM student ORDER BY name DESC;

## 7. Limiting Results with LIMIT

In [26]:
# Get only 5 rows:

SELECT * FROM student LIMIT 5;

In [27]:
# Get 5 rows starting from the 3rd (offset 2):

SELECT * FROM student LIMIT 2, 5;

## 8. Using Wildcards with LIKE

Wildcards are used with the LIKE operator to search for patterns. They’re helpful when you're not exactly sure about the full value, or you want to match based on structure or partial content.

- There are two wildcards in MySQL:

> % – Matches zero or more characters
> 
> _ – Matches exactly one character

##### Example: Names starting with 'A'

SELECT * FROM students

WHERE name LIKE 'A%';

In [28]:
# This finds any name that starts with 'A', like Aakash, Ananya, Aryan.

#### Matching Dates with _ Wildcard
> The _ wildcard is useful for matching specific patterns in date strings, especially in YYYY-MM-DD format.
>
> Let’s say you want to find records from the 5th day of any month:

SELECT * FROM attendance

WHERE date LIKE '____-__-05';

##### Explanation:

- ____ matches any year (4 characters)
- __ matches any month (2 characters)
- 05 is the 5th day

You’re basically telling MySQL:

"Give me all rows where the date ends with -05 — which means the 5th of any month, any year."

##### More Date Pattern Examples

In [29]:
import pandas as pd

# Create a small dataset
data = {
    'Pattern To be Matched': ['2025-05-%', '2024-12-__', '____-01-01', '202_-__-__', '____-__-3_'],
    'Matches': ['Any day in May 2025', 'All 2-digit days in December 2024', '1st January of any year', 'Any date in the 2020s decade', 'All dates from day 30 to 39 (not valid, but works syntactically)']
}

df = pd.DataFrame(data)
df

  Pattern To be Matched                                            Matches
0             2025-05-%                                Any day in May 2025
1            2024-12-__                  All 2-digit days in December 2024
2            ____-01-01                            1st January of any year
3            202_-__-__                       Any date in the 2020s decade
4            ____-__-3_  All dates from day 30 to 39 (not valid, but wo...

##### Quick Recap: LIKE Wildcard Matching

In [31]:
import pandas as pd

# Create a small dataset
data = {
    'Pattern': ['A%', '%sh', '%ar%', 'R____', '____-__-05'],
    'Correct Syntax': ['Starts with A', 'Ends with sh', 'Contains ar', '5-letter name starting with R', 'Dates with day = 05']
}

df = pd.DataFrame(data)
df

      Pattern                 Correct Syntax
0          A%                  Starts with A
1         %sh                   Ends with sh
2        %ar%                    Contains ar
3       R____  5-letter name starting with R
4  ____-__-05            Dates with day = 05